InformationRegisters/ИсторияЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЛида</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписиВМобильномПриложении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыСозданияЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыСозданияЛида</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриВходящемЗвонке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриРазбореИсторииАТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриРазбореЭлектронныхЯщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПоДаннымРойстат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПоДаннымБитрикс24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзExcel</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РекламнаяАкция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РекламнаяАкция</Name>
			<Comment>Действующие рекламные акции организации</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РекламныеИсточники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РекламныеИсточники</Name>
			<Comment>Рекламные источники (газета, ТВ, радио и прочее)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВРознице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОчищатьРанееУстановленныеРеквизитыВЛидеПриУстановкеНовыхЗначений</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентАгентские</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяАкция</Name>
					<Comment>#14718</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламнаяАкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_РойстатИмяРекламногоИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТелефонныеНомера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТелефонныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РекламныеИсточникиРойстат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ФормаЗагрузкиЛидовИзExcel/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравилоПоискаИсторииОбращений = Константы.ПравилоПоискаИсторииОбращений.Получить().Получить();
	Если ПравилоПоискаИсторииОбращений = Неопределено Тогда
		ПравилоПоискаИсторииОбращений = Новый Структура("ПоТелефону, ПоАдресуЭлектроннойПочты", Ложь, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	Отказ = Ложь;
	Если НомерКолонкиИмяКлиента = 0 Тогда 
		Сообщить("Колонка ""Имя клиента"" обязательная, необходимо задать её номер");
		Отказ = Истина;
	КонецЕсли;
	Если НомерКолонкиОсновнойТелефон = 0 Тогда 
		Сообщить("Колонка ""Основной телефон"" обязательная, необходимо задать её номер");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ТабЗнач.Очистить();
	
	Попытка
		ExcelПриложение = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Ошибка работы с Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	Попытка
		Файл = ExcelПриложение.WorkBooks.Open(ПутьКФайлу);
	Исключение
		Сообщить("Ошибка открытия файла." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	Попытка
		Лист = Файл.Sheets(1);
		xlCellTypeLastCell = 11;
		ПоследняяСтрока = Лист.Cells.SpecialCells(xlCellTypeLastCell).Row;
	Исключение
		Сообщить("Ошибка открытия листа №1." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		ExcelПриложение.Quit();
		Возврат;
	КонецПопытки;
	
	МассивОповещенийНеНайдено = новый Массив;
	
	Для Строка = НачСтр По ПоследняяСтрока Цикл
		Попытка
			ОсновнойТелефон = СокрЛП(Лист.Cells(Строка, НомерКолонкиОсновнойТелефон).Text);
			Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда 
				Стр = ТабЗнач.Добавить();
				Стр.ОсновнойТелефон = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(ОсновнойТелефон);
				Стр.ИмяКлиента = СокрЛП(Лист.Cells(Строка, НомерКолонкиИмяКлиента).Text);
				Если НомерКолонкиДополнительныйТелефон <> 0 Тогда					
					Стр.ДополнительныйТелефон = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(СокрЛП(Лист.Cells(Строка, НомерКолонкиДополнительныйТелефон).Text));
				КонецЕсли;
				Если НомерКолонкиЭлектроннаяПочта <> 0 Тогда
					Стр.ЭлектроннаяПочта = СокрЛП(Лист.Cells(Строка, НомерКолонкиЭлектроннаяПочта).Text);
				КонецЕсли;
				Если НомерКолонкиВидКонтакта <> 0 Тогда
					ВидКонтакта = СокрЛП(Лист.Cells(Строка, НомерКолонкиВидКонтакта).Text);
					Если ЗначениеЗаполнено(ВидКонтакта) Тогда
						Стр.ВидКонтакта = НайтиВидКонтакта(ВидКонтакта, МассивОповещенийНеНайдено);
					КонецЕсли;	
				КонецЕсли;
				Если НомерКолонкиРекламнаяАкция <> 0 Тогда
					РекламнаяАкция = СокрЛП(Лист.Cells(Строка, НомерКолонкиРекламнаяАкция).Text);					
					Если ЗначениеЗаполнено(РекламнаяАкция) Тогда
						Стр.РекламнаяАкция = НайтиРекламнуюАкцию(РекламнаяАкция, МассивОповещенийНеНайдено);
					КонецЕсли;	
				КонецЕсли;
				Если НомерКолонкиТочкаПродаж <> 0 Тогда
					ТочкаПродаж = СокрЛП(Лист.Cells(Строка, НомерКолонкиТочкаПродаж).Text);
					Если ЗначениеЗаполнено(ТочкаПродаж) Тогда
						Стр.ТочкаПродаж = НайтиТочкуПродаж(ТочкаПродаж, МассивОповещенийНеНайдено);
					КонецЕсли;
				КонецЕсли;
				Если НомерКолонкиРекламныйИсточник <> 0 Тогда
					РекламныйИсточник = СокрЛП(Лист.Cells(Строка, НомерКолонкиРекламныйИсточник).Text);
					Если ЗначениеЗаполнено(РекламныйИсточник) Тогда
						Стр.РекламныйИсточник = НайтиРекламныйИсточник(РекламныйИсточник, МассивОповещенийНеНайдено);
					КонецЕсли;
				КонецЕсли;
				
				Если НомерКолонкиГород <> 0 Тогда
					Город = СокрЛП(Лист.Cells(Строка, НомерКолонкиГород).Text);
					Если ЗначениеЗаполнено(Город) Тогда
						Стр.Город = НайтиГород(Город, МассивОповещенийНеНайдено);
					КонецЕсли;
				КонецЕсли;
				Если НомерКолонкиАдрес <> 0 Тогда
					Стр.Адрес = СокрЛП(Лист.Cells(Строка, НомерКолонкиАдрес).Text);
				КонецЕсли;

				Если НомерКолонкиАвтор <> 0 Тогда
					Автор = СокрЛП(Лист.Cells(Строка, НомерКолонкиАвтор).Text);
					Если ЗначениеЗаполнено(Автор) Тогда
						Стр.Автор = НайтиПользователя(Автор);
					КонецЕсли;
				КонецЕсли;
				Если НомерКолонкиПримечание <> 0 Тогда
					Стр.Примечание = СокрЛП(Лист.Cells(Строка, НомерКолонкиПримечание).Text);
				КонецЕсли;
				Если НомерКолонкиЗаписьВИсторию <> 0 Тогда
					Стр.ЗаписьВИсторию = СокрЛП(Лист.Cells(Строка, НомерКолонкиЗаписьВИсторию).Text);
				КонецЕсли;
				Стр.Пометка = Истина;
			конецесли;
		Исключение
			Сообщить("Ошибка чтения строки файла." + Строка + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
	КонецЦикла;
	ExcelПриложение.Quit();
	
	//Оповещаем о не найденных элементах
	МассивПовтояющихсяОповещений = новый Массив;
	Для Каждого Оповещение Из МассивОповещенийНеНайдено Цикл
		Если МассивПовтояющихсяОповещений.Найти(Оповещение) = Неопределено Тогда
			Сообщить(Оповещение);
			МассивПовтояющихсяОповещений.Добавить(Оповещение);
		КонецЕсли;
	КонецЦикла;
	
	НайтиСуществующихЛидов();
	
	ПоказатьОповещениеПользователя ("Чтение файла завершено");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиВидКонтакта(Наименование, МассивОповещенийНеНайдено)
	ОбъектКВозврату = Справочники.ВидыКонтактов.НайтиПоНаименованию(Наименование);
	Если ОбъектКВозврату.Пустая() Тогда
		МассивОповещенийНеНайдено.Добавить("Не найден вид контакта с наименованием " + Наименование);
	КонецЕсли;
	Возврат ОбъектКВозврату;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиРекламнуюАкцию(Наименование, МассивОповещенийНеНайдено)
	ОбъектКВозврату = Справочники.РекламнаяАкция.НайтиПоНаименованию(Наименование);
	Если ОбъектКВозврату.Пустая() Тогда
		МассивОповещенийНеНайдено.Добавить("Не найдена рекламная акция с наименованием " + Наименование);
	КонецЕсли;
	Возврат ОбъектКВозврату;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиТочкуПродаж(Наименование, МассивОповещенийНеНайдено)
	ОбъектКВозврату = Справочники.ТочкиПродаж.ПолучитьЭлементПоНаименованию(Наименование);
	Если ОбъектКВозврату.Пустая() Тогда
		МассивОповещенийНеНайдено.Добавить("Не найдена точка продаж с наименованием " + Наименование);
	КонецЕсли;
	Возврат ОбъектКВозврату;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиРекламныйИсточник(Наименование, МассивОповещенийНеНайдено)
	ОбъектКВозврату = Справочники.РекламныеИсточники.НайтиПоНаименованию(Наименование);
	Если ОбъектКВозврату.Пустая() Тогда
		МассивОповещенийНеНайдено.Добавить("Не найдена точка продаж с наименованием " + Наименование);
	КонецЕсли;
	Возврат ОбъектКВозврату;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиГород(Наименование, МассивОповещенийНеНайдено)
	ОбъектКВозврату = Справочники.Города.НайтиПоНаименованию(Наименование);
	Если ОбъектКВозврату.Пустая() Тогда
		МассивОповещенийНеНайдено.Добавить("Не найден город с наименованием " + Наименование);
	КонецЕсли;
	Возврат ОбъектКВозврату;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПользователя(Наименование)
	Возврат Справочники.Пользователи.НайтиПоНаименованию(Наименование);
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр =  "Файлы Excel|*.xls;*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл Excel";
	ДиалогОткрытияФайла.Выбрать();
	ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
КонецПроцедуры

&НаСервере
Процедура НайтиСуществующихЛидов()
	
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		ПолучитьДублирующиеЛиды(ТекущаяСтрока);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДублирующиеЛиды(ТекущаяСтрока)
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ОсновнойТелефон) 
		И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДополнительныйТелефон) 
		И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЭлектроннаяПочта) Тогда
		Возврат;
	КонецЕсли;
	
	ТелефоныКлиента = Новый Массив;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ОсновнойТелефон) Тогда
		ТелефоныКлиента.Добавить(ТекущаяСтрока.ОсновнойТелефон);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДополнительныйТелефон) Тогда
		ТелефоныКлиента.Добавить(ТекущаяСтрока.ДополнительныйТелефон);	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоискПоТелефону", ПравилоПоискаИсторииОбращений.ПоТелефону);
	Запрос.УстановитьПараметр("ПоискПоПочте", ПравилоПоискаИсторииОбращений.ПоАдресуЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТелефоныКлиента", ТелефоныКлиента);
	Запрос.УстановитьПараметр("ЭлектроннаяПочтаКлиента", ТекущаяСтрока.ЭлектроннаяПочта);	

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Лид.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лид КАК Лид
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лид.ДополнительнаяКонтактнаяИнформация КАК ЛидКИ
	|		ПО (ЛидКИ.Ссылка = Лид.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказДоговор КАК ЗаказДоговор
	|		ПО Лид.Ссылка = ЗаказДоговор.Основание
	|			И (ЗаказДоговор.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.Выполнен))
	|ГДЕ
	|	(ВЫБОР
	|				КОГДА &ПоискПоТелефону
	|					ТОГДА ЛидКИ.Представление В (&ТелефоныКлиента)
	|							И ЛидКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА &ПоискПоПочте
	|					ТОГДА НЕ &ЭлектроннаяПочтаКлиента ПОДОБНО """"
	|							И ЛидКИ.Представление ПОДОБНО &ЭлектроннаяПочтаКлиента
	|							И ЛидКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лид.Дата";
		
	Результат = Запрос.Выполнить();
	
	ТекущаяСтрока.ДублирующийЛид.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ТекущаяСтрока.ЕстьДубли = (ТекущаяСтрока.ДублирующийЛид.Количество() > 0);
	ТекущаяСтрока.Пометка = НЕ ТекущаяСтрока.ЕстьДубли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛиды(Команда)
	ЗагрузитьЛидыНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЛидыНаСервере()	
	
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		Если НЕ ТекущаяСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		//#14718 сначала заполняем структуру , потом объект согласно порядку
		СтруктураПолей = ОбщийМодульСервер.СтруктураПолейЛидаПриАвтоматическомСоздании();
	
		ДокументОбъект = Документы.Лид.СоздатьДокумент();
		ДокументОбъект.Заполнить(Неопределено);
		ДокументОбъект.СпособСоздания = Перечисления.СпособыСозданияЛида.ЗагруженИзExcel; //#8090
		ДокументОбъект.Дата = ТекущаяДатаСеанса();		
		ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЛида.НазначитьЗамер;
		
		//Поля из таблицы		
		//ДокументОбъект.ВидКонтакта 		 = ТекущаяСтрока.ВидКонтакта;
		//ДокументОбъект.РекламнаяАкция 	 = ТекущаяСтрока.РекламнаяАкция;
		//ДокументОбъект.ТочкаПродаж 		 = ТекущаяСтрока.ТочкаПродаж;
		//ДокументОбъект.РекламныйИсточник = ТекущаяСтрока.РекламныйИсточник;		
		//ДокументОбъект.ОсновнойТелефонКлиента = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(ТекущаяСтрока.ОсновнойТелефон);
		//ДокументОбъект.ИмяКлиента = ТекущаяСтрока.ИмяКлиента;
		СтруктураПолей.ВидКонтакта 		 = ТекущаяСтрока.ВидКонтакта;
		СтруктураПолей.РекламнаяАкция 	 = ТекущаяСтрока.РекламнаяАкция;
		СтруктураПолей.ТочкаПродаж 		 = ТекущаяСтрока.ТочкаПродаж;
		СтруктураПолей.РекламныйИсточник = ТекущаяСтрока.РекламныйИсточник;		
		СтруктураПолей.ТелефонКлиента 	 = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(ТекущаяСтрока.ОсновнойТелефон);
		СтруктураПолей.ИмяКлиента = ТекущаяСтрока.ИмяКлиента;
		
		ОбщийМодульСервер.ЗаполнитьПоляЛидаПриАвтоматическомСоздании(ДокументОбъект, СтруктураПолей);
		
		Если НомерКолонкиДополнительныйТелефон <> 0 И ЗначениеЗаполнено(ТекущаяСтрока.ДополнительныйТелефон) Тогда
			ДополнительныйТелефонКлиента = СофтФон.ПолучитьНомерТелефонаВМеждународномФОрматеПользователя(ТекущаяСтрока.ДополнительныйТелефон);
			УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ДокументОбъект, ДополнительныйТелефонКлиента, 
			 																	 Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, 
																				 Перечисления.ТипыКонтактнойИнформации.Телефон, Новый УникальныйИдентификатор);
		КонецЕсли;
		Если НомерКолонкиЭлектроннаяПочта <> 0 И ЗначениеЗаполнено(ТекущаяСтрока.ЭлектроннаяПочта) Тогда
			УправлениеКонтактнойИнформациейПотолки.ЗаписатьКонтактнуюИнформацию(ДокументОбъект, ТекущаяСтрока.ЭлектроннаяПочта, 
			 															    Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, 
																			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Новый УникальныйИдентификатор);
		КонецЕсли;		
		ДокументОбъект.Комментарий 		 = "#Создан обработкой загрузки Лидов#" + " " + ТекущаяСтрока.Примечание;	
			
		ДокументОбъект.Город 			 = ТекущаяСтрока.Город;
		ДокументОбъект.Адрес 			 = ТекущаяСтрока.Адрес;
		ДокументОбъект.Автор 	 		 = ТекущаяСтрока.Автор;	
		
		Попытка
			ДокументОбъект.Записать();			
			
			Комментарий = "Создан Лид обработкой загрузки Лидов ";
			РегистрыСведений.ИсторияЛида.ДобавитьЗаписьВИсториюЛида(ДокументОбъект.Ссылка, ТекущаяДатаСеанса(), ДокументОбъект.Автор, Новый УникальныйИдентификатор, Комментарий);
			
			//Запись в историю из таблицы, если поле заполнено
			Если ЗначениеЗаполнено(ТекущаяСтрока.ЗаписьВИсторию) Тогда
				РегистрыСведений.ИсторияЛида.ДобавитьЗаписьВИсториюЛида(ДокументОбъект.Ссылка, ТекущаяДатаСеанса(), ДокументОбъект.Автор, Новый УникальныйИдентификатор, ТекущаяСтрока.ЗаписьВИсторию);
			КонецЕсли;
			
			Сообщить("Создан " + ДокументОбъект.Ссылка + " по основному номеру телефона " + ТекущаяСтрока.ОсновнойТелефон);
			ОбщийМодуль.УстановитьНеобходимостьОбновленияАРМРозницы();			
		Исключение
			Сообщить("Не удалось записать Лид с основным номером телефона " +  ТекущаяСтрока.ОсновнойТелефон);
		КонецПопытки;
		
	КонецЦикла;
	
	НайтиСуществующихЛидов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		ТекущаяСтрока.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДублирующиеЛиды(Команда)
	
	ТекущиеДанные = Элементы.ТабЗнач.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ДублирующийЛид.Количество() > 0 Тогда
		ПараметрыФормы = ПолучитьНастройкиОткрытияСписка(ТекущиеДанные.ДублирующийЛид);
		ОткрытьФорму("Документ.Лид.ФормаСписка", новый Структура("ФиксированныеНастройки", ПараметрыФормы), ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОткрытияСписка(СписокДокументов)

	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;	

	Элт = КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элт.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	Элт.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Элт.Использование = Истина;
	Элт.ПравоеЗначение = СписокДокументов;

	Возврат КомпоновщикНастроек.ФиксированныеНастройки

КонецФункции

&НаКлиенте
Процедура ПоказатьТолькоСДублями(Команда)
	Элементы.ТабЗнач.ОтборСтрок = новый ФиксированнаяСтруктура(новый Структура("ЕстьДубли", Истина));	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБезДублей(Команда)
	Элементы.ТабЗнач.ОтборСтрок = новый ФиксированнаяСтруктура(новый Структура("ЕстьДубли", Ложь));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	Элементы.ТабЗнач.ОтборСтрок = Неопределено;
КонецПроцедуры
